* Ссылки [[~/org/sbcl/sbcl-referencies.org][Ссылки]]
* Генерирование документации
#+name: codex
#+BEGIN_SRC lisp
  (codex:document :recoder)
#+END_SRC

#+RESULTS: codex
: NIL

#+name: graphs
#+BEGIN_SRC lisp :var codex=codex
   (loop
     :for i :in '(
		  :recoder
                  :recoder/a-signal
                  :recoder/d-signal
                  :recoder/seq

		  )
     :do (mnas-package:make-codex-graphs i i))
#+END_SRC

#+RESULTS: graphs
: NIL
* Публикация
#+name: publish
#+BEGIN_SRC shell :var graphs=graphs
    mkdir -p "$HOME/public_html/Common-Lisp-Programs/"
    CDIR=`dirname $PWD | xargs basename`
    rsync -Pazh --delete ../docs/build/$CDIR/html/ $HOME/public_html/Common-Lisp-Programs/$CDIR 
    if [[ `hostname` == "mnasoft-00" ]]
    then
	echo "mnasoft-00"
  #     sh ~/bin/pi-html
    fi
    if [[ `hostname` == "N118383" ]]
    then
	echo "N118383"
        CPL="//n133619/home/_namatv/public_html/Site/Development/Common-Lisp-Programs"
	mkdir -p $CPL/$CDIR
	rsync -Pazh --delete ../docs/build/$CDIR/html/ $CPL/$CDIR
     fi
#+END_SRC

#+RESULTS: publish
| sending                              | incremental | file | list       |         |   |         |      |            |         |          |               |
| ./                                   |             |      |            |         |   |         |      |            |         |          |               |
| call-graph-recoder-a-signal.gv       |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 1.34K       | 100% | 0.00kB/s   | 0:00:00 |   | 1.34K   | 100% | 0.00kB/s   | 0:00:00 | (xfr#1,  | to-chk=51/53) |
| call-graph-recoder-a-signal.gv.png   |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 32.77K      |  11% | 31.25MB/s  | 0:00:00 |   | 292.50K | 100% | 55.79MB/s  | 0:00:00 | (xfr#2,  | to-chk=50/53) |
| call-graph-recoder-d-signal.gv       |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 562         | 100% | 109.77kB/s | 0:00:00 |   | 562     | 100% | 109.77kB/s | 0:00:00 | (xfr#3,  | to-chk=49/53) |
| call-graph-recoder-d-signal.gv.png   |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 32.77K      |  29% | 6.25MB/s   | 0:00:00 |   | 111.75K | 100% | 17.76MB/s  | 0:00:00 | (xfr#4,  | to-chk=48/53) |
| call-graph-recoder-seq.gv            |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 865         | 100% | 120.68kB/s | 0:00:00 |   | 865     | 100% | 120.68kB/s | 0:00:00 | (xfr#5,  | to-chk=47/53) |
| call-graph-recoder-seq.gv.png        |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 32.77K      |  14% | 4.46MB/s   | 0:00:00 |   | 220.38K | 100% | 21.02MB/s  | 0:00:00 | (xfr#6,  | to-chk=46/53) |
| call-graph-recoder.gv                |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 45          | 100% | 4.39kB/s   | 0:00:00 |   | 45      | 100% | 4.39kB/s   | 0:00:00 | (xfr#7,  | to-chk=45/53) |
| call-graph-recoder.gv.png            |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 116         | 100% | 11.33kB/s  | 0:00:00 |   | 116     | 100% | 11.33kB/s  | 0:00:00 | (xfr#8,  | to-chk=44/53) |
| class-graph-recoder-a-signal.gv      |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 58          | 100% | 5.66kB/s   | 0:00:00 |   | 58      | 100% | 5.66kB/s   | 0:00:00 | (xfr#9,  | to-chk=43/53) |
| class-graph-recoder-a-signal.gv.png  |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 7.64K       | 100% | 746.19kB/s | 0:00:00 |   | 7.64K   | 100% | 746.19kB/s | 0:00:00 | (xfr#10, | to-chk=42/53) |
| class-graph-recoder-d-signal.gv      |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 58          | 100% | 5.66kB/s   | 0:00:00 |   | 58      | 100% | 5.66kB/s   | 0:00:00 | (xfr#11, | to-chk=41/53) |
| class-graph-recoder-d-signal.gv.png  |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 7.85K       | 100% | 766.50kB/s | 0:00:00 |   | 7.85K   | 100% | 766.50kB/s | 0:00:00 | (xfr#12, | to-chk=40/53) |
| class-graph-recoder-seq.gv           |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 159         | 100% | 15.53kB/s  | 0:00:00 |   | 159     | 100% | 15.53kB/s  | 0:00:00 | (xfr#13, | to-chk=39/53) |
| class-graph-recoder-seq.gv.png       |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 28.61K      | 100% | 2.48MB/s   | 0:00:00 |   | 28.61K  | 100% | 2.48MB/s   | 0:00:00 | (xfr#14, | to-chk=38/53) |
| class-graph-recoder.gv               |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 45          | 100% | 4.00kB/s   | 0:00:00 |   | 45      | 100% | 4.00kB/s   | 0:00:00 | (xfr#15, | to-chk=37/53) |
| class-graph-recoder.gv.png           |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 116         | 100% | 10.30kB/s  | 0:00:00 |   | 116     | 100% | 10.30kB/s  | 0:00:00 | (xfr#16, | to-chk=36/53) |
| export-to.html                       |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 2.94K       | 100% | 260.83kB/s | 0:00:00 |   | 2.94K   | 100% | 260.83kB/s | 0:00:00 | (xfr#17, | to-chk=35/53) |
| method.html                          |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 8.67K       | 100% | 769.98kB/s | 0:00:00 |   | 8.67K   | 100% | 769.98kB/s | 0:00:00 | (xfr#18, | to-chk=34/53) |
| recoder-seq.html                     |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 6.35K       | 100% | 563.65kB/s | 0:00:00 |   | 6.35K   | 100% | 563.65kB/s | 0:00:00 | (xfr#19, | to-chk=33/53) |
| symbol-graph-recoder-a-signal.gv     |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 112         | 100% | 9.94kB/s   | 0:00:00 |   | 112     | 100% | 9.94kB/s   | 0:00:00 | (xfr#20, | to-chk=32/53) |
| symbol-graph-recoder-a-signal.gv.png |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 14.57K      | 100% | 1.26MB/s   | 0:00:00 |   | 14.57K  | 100% | 1.26MB/s   | 0:00:00 | (xfr#21, | to-chk=31/53) |
| symbol-graph-recoder-d-signal.gv     |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 45          | 100% | 4.00kB/s   | 0:00:00 |   | 45      | 100% | 4.00kB/s   | 0:00:00 | (xfr#22, | to-chk=30/53) |
| symbol-graph-recoder-d-signal.gv.png |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 116         | 100% | 10.30kB/s  | 0:00:00 |   | 116     | 100% | 10.30kB/s  | 0:00:00 | (xfr#23, | to-chk=29/53) |
| symbol-graph-recoder-seq.gv          |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 114         | 100% | 10.12kB/s  | 0:00:00 |   | 114     | 100% | 10.12kB/s  | 0:00:00 | (xfr#24, | to-chk=28/53) |
| symbol-graph-recoder-seq.gv.png      |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 18.85K      | 100% | 1.63MB/s   | 0:00:00 |   | 18.85K  | 100% | 1.63MB/s   | 0:00:00 | (xfr#25, | to-chk=27/53) |
| symbol-graph-recoder.gv              |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 45          | 100% | 4.00kB/s   | 0:00:00 |   | 45      | 100% | 4.00kB/s   | 0:00:00 | (xfr#26, | to-chk=26/53) |
| symbol-graph-recoder.gv.png          |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 116         | 100% | 10.30kB/s  | 0:00:00 |   | 116     | 100% | 10.30kB/s  | 0:00:00 | (xfr#27, | to-chk=25/53) |
| system-graph-recoder-a-signal.gv     |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 45          | 100% | 4.00kB/s   | 0:00:00 |   | 45      | 100% | 4.00kB/s   | 0:00:00 | (xfr#28, | to-chk=24/53) |
| system-graph-recoder-a-signal.gv.png |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 116         | 100% | 10.30kB/s  | 0:00:00 |   | 116     | 100% | 10.30kB/s  | 0:00:00 | (xfr#29, | to-chk=23/53) |
| system-graph-recoder-d-signal.gv     |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 45          | 100% | 4.00kB/s   | 0:00:00 |   | 45      | 100% | 4.00kB/s   | 0:00:00 | (xfr#30, | to-chk=22/53) |
| system-graph-recoder-d-signal.gv.png |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 116         | 100% | 10.30kB/s  | 0:00:00 |   | 116     | 100% | 9.44kB/s   | 0:00:00 | (xfr#31, | to-chk=21/53) |
| system-graph-recoder-seq.gv          |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 2.38K       | 100% | 194.01kB/s | 0:00:00 |   | 2.38K   | 100% | 194.01kB/s | 0:00:00 | (xfr#32, | to-chk=20/53) |
| system-graph-recoder-seq.gv.png      |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 32.77K      |   2% | 2.60MB/s   | 0:00:00 |   | 1.16M   | 100% | 30.69MB/s  | 0:00:00 | (xfr#33, | to-chk=19/53) |
| system-graph-recoder.gv              |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 2.77K       | 100% | 75.20kB/s  | 0:00:00 |   | 2.77K   | 100% | 75.20kB/s  | 0:00:00 | (xfr#34, | to-chk=18/53) |
| system-graph-recoder.gv.png          |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 32.77K      |   2% | 888.89kB/s | 0:00:01 |   | 1.32M   | 100% | 22.03MB/s  | 0:00:00 | (xfr#35, | to-chk=17/53) |
| trd-analog.html                      |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 9.17K       | 100% | 157.09kB/s | 0:00:00 |   | 9.17K   | 100% | 157.09kB/s | 0:00:00 | (xfr#36, | to-chk=16/53) |
| trd-discret.html                     |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 7.03K       | 100% | 120.43kB/s | 0:00:00 |   | 7.03K   | 100% | 120.43kB/s | 0:00:00 | (xfr#37, | to-chk=15/53) |
| trd-separate.html                    |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 4.79K       | 100% | 82.01kB/s  | 0:00:00 |   | 4.79K   | 100% | 82.01kB/s  | 0:00:00 | (xfr#38, | to-chk=14/53) |
| trd-split.html                       |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 6.23K       | 100% | 106.74kB/s | 0:00:00 |   | 6.23K   | 100% | 106.74kB/s | 0:00:00 | (xfr#39, | to-chk=13/53) |
| variables.html                       |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 5.89K       | 100% | 100.86kB/s | 0:00:00 |   | 5.89K   | 100% | 100.86kB/s | 0:00:00 | (xfr#40, | to-chk=12/53) |
| графы-recoder-a-signal.html          |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 3.25K       | 100% | 55.72kB/s  | 0:00:00 |   | 3.25K   | 100% | 55.72kB/s  | 0:00:00 | (xfr#41, | to-chk=11/53) |
| графы-recoder-d-signal.html          |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 3.25K       | 100% | 55.72kB/s  | 0:00:00 |   | 3.25K   | 100% | 55.72kB/s  | 0:00:00 | (xfr#42, | to-chk=10/53) |
| графы-recoder-seq.html               |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 3.21K       | 100% | 55.06kB/s  | 0:00:00 |   | 3.21K   | 100% | 55.06kB/s  | 0:00:00 | (xfr#43, | to-chk=9/53)  |
| графы-recoder.html                   |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 3.16K       | 100% | 54.17kB/s  | 0:00:00 |   | 3.16K   | 100% | 54.17kB/s  | 0:00:00 | (xfr#44, | to-chk=8/53)  |
| класс-<a-signal>.html                |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 16.63K      | 100% | 284.98kB/s | 0:00:00 |   | 16.63K  | 100% | 284.98kB/s | 0:00:00 | (xfr#45, | to-chk=7/53)  |
| класс-<d-signal>.html                |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 10.62K      | 100% | 181.98kB/s | 0:00:00 |   | 10.62K  | 100% | 181.98kB/s | 0:00:00 | (xfr#46, | to-chk=6/53)  |
| класс-<trd>.html                     |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 26.72K      | 100% | 457.79kB/s | 0:00:00 |   | 26.72K  | 100% | 457.79kB/s | 0:00:00 | (xfr#47, | to-chk=5/53)  |
| обзор.html                           |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 3.73K       | 100% | 63.92kB/s  | 0:00:00 |   | 3.73K   | 100% | 63.92kB/s  | 0:00:00 | (xfr#48, | to-chk=4/53)  |
| static/                              |             |      |            |         |   |         |      |            |         |          |               |
| static/highlight.css                 |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 1.57K       | 100% | 26.92kB/s  | 0:00:00 |   | 1.57K   | 100% | 26.92kB/s  | 0:00:00 | (xfr#49, | to-chk=2/53)  |
| static/highlight.js                  |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 22.99K      | 100% | 387.07kB/s | 0:00:00 |   | 22.99K  | 100% | 387.07kB/s | 0:00:00 | (xfr#50, | to-chk=1/53)  |
| static/style.css                     |             |      |            |         |   |         |      |            |         |          |               |
|                                      | 4.32K       | 100% | 72.70kB/s  | 0:00:00 |   | 4.32K   | 100% | 72.70kB/s  | 0:00:00 | (xfr#51, | to-chk=0/53)  |
| mnasoft-00                           |             |      |            |         |   |         |      |            |         |          |               |
